html/scheme/tutorial/loop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>循环</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="local_variable.html"> UP </a>
 |
 <a accesskey="H" href="slt.html"> HOME </a>
</div><div id="content">
<h1 class="title">循环</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org14a4e7e">递归</a></li>
<li><a href="#org35a4962">尾递归</a></li>
<li><a href="#org145821a">命名 let</a></li>
<li><a href="#org08d460f">letrec 表达式</a></li>
<li><a href="#orgfe73cb2">do 表达式</a></li>
<li><a href="#org116eb74">总结</a></li>
</ul>
</div>
</div>
<p>
本章中会介绍循环。通过循环，可以编写“通常的”程序
</p>

<p>
虽然也可以使用 <span class="underline">do表达式</span> ，但 Scheme 中通常 <b>通过递归实现循环</b> 
</p>
<div id="outline-container-org14a4e7e" class="outline-2">
<h2 id="org14a4e7e">递归</h2>
<div class="outline-text-2" id="text-org14a4e7e">
<p>
在 <b>自己的定义中调用自己</b> 的函数叫做 <span class="underline">递归函数</span> （Recursive Function）。虽然这听起来很奇怪，但是循环的常见方法。如果你把函数类比为机器的话，递归似乎毫无道理。然而，正 <b>因为函数是过程</b> ，函数调用自己是有意义的。比如说，来考察一下文献调研吧。可能需要去阅读你正在阅读的文献所引用的文献（cited-1）。进一步，你可能还需要去阅读文件（cite-1）所引用的其它文献。这样，文献调研就是一个递归的过程，也可以重复这个调研过程直到满足了特定条件（比如说，你累了）。这样，将程序设计语言中的函数类比为人类活动（比如文献调研）将有助于理解递归函数
</p>

<p>
通常使用计算阶乘来解释递归：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n 1<span style="color: #696969;">)</span>
      1
      <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>fact <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span>fact 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 120</span>
</pre>
</div>

<p>
<span class="underline">(fact 5)</span> 的计算过程如下：
</p>

<pre class="example">
(fact 5)
=&gt; 5 * (fact 4)
=&gt; 5 * 4 * (fact 3)
=&gt; 5 * 4 * 3 * (fact 2)
=&gt; 5 * 4 * 3 * 2 * (fact 1)
=&gt; 5 * 4 * 3 * 2 * 1
=&gt; 5 * 4 * 3 * 2
=&gt; 5 * 4 * 6
=&gt; 5 * 24
=&gt; 120
</pre>
<p>
(fact 5) 调用 (fact 4)，(fact 4) 调用 (fact 3)，最后 (fact 1) 被调用。(fact 5)，(fact 4)……以及(fact 1)都被 <b>分配了不同的存储空间</b> ，直到 (fact (- i 1))返回一个值之前，(fact i)都会保留在内存中，由于存在函数调用的开销，这通常会 <b>占用更多地内存空间和计算时间</b> 
</p>

<p>
然而， 递归函数可以以 <b>一种简单的方式表达重复</b> 。表是被 <span class="underline">递归定义</span> 的，进而 <b>表和递归函数可以很好地配合</b> 
</p>

<pre class="example">
    例如，一个让表中所有元素翻倍的函数可以像下面这样写

    如果参数是空表，那么函数应该停止计算并返回一个空表
</pre>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">list*2</span> ls<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? ls<span style="color: #696969;">)</span>
      '<span style="color: #696969;">()</span>
      <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>* 2 <span style="color: #696969;">(</span>car ls<span style="color: #696969;">))</span>
            <span style="color: #696969;">(</span>list*2 <span style="color: #696969;">(</span>cdr ls<span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span>list*2 '<span style="color: #696969;">(</span>1 2 3<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (2 4 6) </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org35a4962" class="outline-2">
<h2 id="org35a4962">尾递归</h2>
<div class="outline-text-2" id="text-org35a4962">
<p>
普通的递归调用并不高效因为它 <span class="underline">既浪费存储空间</span> 又具有 <span class="underline">函数调用开销</span> 。与之相反，尾递归函数 <b>包含了计算结果，当计算结束时直接将其返回</b> 。特别地，由于Scheme规范要求 <b>尾递归调用转化为循环</b> ，因此尾递归调用就不存在函数调用开销。下面是函数fact的尾递归版本：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">tail recursive</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact-tail</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>fact-rec n n<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact-rec</span> n p<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n 1<span style="color: #696969;">)</span>
      p
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>m <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>fact-rec m <span style="color: #696969;">(</span>* p m<span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span>fact-tail 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">120</span>
</pre>
</div>

<p>
<span class="underline">fact-tail</span> 计算阶乘的过程像这样：
</p>

<pre class="example">
(fact-tail 5)
=&gt; (fact-rec 5 5)
=&gt; (fact-rec 4 20)
=&gt; (fact-rec 3 60)
=&gt; (fact-rec 2 120)
=&gt; (fact-rec 1 120)
=&gt; 120
</pre>
<p>
因为 <span class="underline">fact-rec</span> 并不 <b>等待其它函数的计算结果</b> ，因此当它 <b>计算结束时即从内存中释放</b> 。计算通过 <b>修改 fact-rec 的参数来演进</b> ，这基本上等同于循环
</p>

<pre class="example">
Scheme将尾递归转化为循环，Scheme 就无需提供循环的语法来实现重复
</pre>
</div>
</div>
<div id="outline-container-org145821a" class="outline-2">
<h2 id="org145821a">命名 let</h2>
<div class="outline-text-2" id="text-org145821a">
<p>
<span class="underline">命名 let</span> 可以用来 <b>表达循环</b> 。函数 <span class="underline">fact-let</span> 展示了如何使用 <span class="underline">命名 let</span> 来计算阶乘：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact-let</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span><span style="color: #696969;">((</span>n1 n<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>p n<span style="color: #696969;">))</span>           <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">1</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n1 1<span style="color: #696969;">)</span>                    
        p
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>m <span style="color: #696969;">(</span>- n1 1<span style="color: #696969;">)))</span>
          <span style="color: #696969;">(</span>loop m <span style="color: #696969;">(</span>* p m<span style="color: #696969;">))))))</span>      <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">2</span>

<span style="color: #696969;">(</span>fact-let 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">120 </span>
</pre>
</div>

<p>
这里使用了一个 命名 let 表达式 <span class="underline">loop</span> ，这与之前展示的 fact-rec 函数是不同的
</p>
<ul class="org-ul">
<li>在被注释为 ;1 的那行，将参数 n1 和 p 都初始化为 n</li>
<li>每次循环后，参数在被注释为 ;2 的那行更新：
<ul class="org-ul">
<li>将 n1 减 1</li>
<li>将 p 乘以 (n1 - 1)</li>
</ul></li>
</ul>

<pre class="example">
    在Scheme中，用 命名let 来表达循环是俗成的方法
</pre>
</div>
</div>
<div id="outline-container-org08d460f" class="outline-2">
<h2 id="org08d460f">letrec 表达式</h2>
<div class="outline-text-2" id="text-org08d460f">
<p>
<span class="underline">letrec</span> 类似于 let，但它 <b>允许一个名字递归地调用它自己</b> 。语法 letrec通常用于 <b>定义复杂的递归函数</b> 。下面展示了 fact 函数的 <span class="underline">letrec</span> 版本：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact-letrec</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">letrec</span> <span style="color: #696969;">((</span>iter <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n1 p<span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n1 1<span style="color: #696969;">)</span>
                       p
                       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>m <span style="color: #696969;">(</span>- n1 1<span style="color: #696969;">)))</span>
                         <span style="color: #696969;">(</span>iter m <span style="color: #696969;">(</span>* p m<span style="color: #696969;">)))))))</span>     <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">*</span>
    <span style="color: #696969;">(</span>iter n n<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span>fact-letrec 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">120 </span>
</pre>
</div>

<p>
注释为 ;* 的那行代码所示：局部函数 <span class="underline">iter</span> 可以在它的定义里面调用它自己
</p>

<pre class="example">
    语法 letrec 是定义局部函数的俗成方式
</pre>
</div>
</div>
<div id="outline-container-orgfe73cb2" class="outline-2">
<h2 id="orgfe73cb2">do 表达式</h2>
<div class="outline-text-2" id="text-orgfe73cb2">
<p>
虽然并不常见，但语法 <span class="underline">do</span> 也可用于表达 <b>重复</b> 。它的格式如下：
</p>

<pre class="example">
(do binds (predicate value)
    body)
</pre>

<p>
<span class="underline">变量</span> 在 <span class="underline">binds部分</span> 被 <b>绑定</b> : 
</p>
<ul class="org-ul">
<li>如果 <span class="underline">predicate</span> 被求值为 <b>真</b> ，则函数从 <b>循环中逃逸</b> 出来，并 <b>返回值value</b></li>
<li>否则， 循环 <span class="underline">body</span> 继续进行</li>
</ul>

<p>
<span class="underline">binds</span> 部分的格式如下所示：
</p>
<pre class="example">
[binds] → ((p1 i1 u1)
	   (p2 i2 u2) ... )
</pre>

<ul class="org-ul">
<li>变量p1，p2，&#x2026;被分别 <b>初始化</b> 为 i1，i2，&#x2026;</li>
<li>在循环后分别被 <b>更新</b> 为 u1，u2，&#x2026;</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">fact-do</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">do</span> <span style="color: #696969;">((</span>n1 n <span style="color: #696969;">(</span>- n1 1<span style="color: #696969;">))</span>
       <span style="color: #696969;">(</span>p n <span style="color: #696969;">(</span>* p <span style="color: #696969;">(</span>- n1 1<span style="color: #696969;">))))</span>
      <span style="color: #696969;">((</span>= n1 1<span style="color: #696969;">)</span> p<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span>fact-do 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">120 </span>
</pre>
</div>

<ul class="org-ul">
<li>变量 n1 和 p 分别被初始化为 n和 n</li>
<li>在每次循环后分别被 减去1 和 乘以 (n1 - 1)</li>
<li>当 n1变为1 时，函数返回 p</li>
</ul>

<pre class="example">
    我个人认为 do 比 命名let 还要复杂一些
</pre>
</div>
</div>
<div id="outline-container-org116eb74" class="outline-2">
<h2 id="org116eb74">总结</h2>
<div class="outline-text-2" id="text-org116eb74">
<ul class="org-ul">
<li><span class="underline">命名let</span> ： 编写 <b>简单的循环</b></li>
<li><span class="underline">letrec</span> ： 写 <b>复杂的局部递归函数</b></li>
</ul>

<p>
<a href="high_order_function.html">Next：高阶函数</a>
</p>

<p>
<a href="local_variable.html">Previous：局部变量</a>
</p>

<p>
<a href="slt.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
